// Lab_03_4.cpp
// <Менчинського Артема>
// Лабораторна робота № 3.4
// Розгалуження, задане плоскою фігурою.
// Варіант 22

#include <iostream>
#include <cmath>
using namespace std;

int main()
{
    double x;  // вхідний аргумент
    double y;  // вхідний параметр
    double R;  // радіус

    // Введення значень для x, y та R
    cout << "R = "; cin >> R;
    cout << "x = "; cin >> x;
    cout << "y = "; cin >> y;

    // Перевірка, чи потрапляє точка (x, y) у півколо або трикутник
    if ((x <= 0 && y >= 0 && (x * x + y * y <= R * R)) ||  // Умова для півкола
        (x > 0 && y <= 0 && y >= -2 * (x - R / 2) && y >= -R))  // Умова для трикутника
    {
        cout << "yes" << endl;  // Точка потрапляє у фігуру
    }
    else
    {
        cout << "no" << endl;  // Точка не потрапляє у фігуру
    }

    cin.get();
    return 0;
}
